Revit 2027 API
BuiltInFailures.CutFailures.CutoutNotCuttingAnythingDeleteOpening Property
 Opening not cutting anything.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CutoutNotCuttingAnythingDeleteOpening { get; }
Public Shared ReadOnly Property CutoutNotCuttingAnythingDeleteOpening As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CutoutNotCuttingAnythingDeleteOpening {
	FailureDefinitionId^ get ();
}
static member CutoutNotCuttingAnythingDeleteOpening : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CutFailures Class
Autodesk.Revit.DB Namespace